['{"Title": "Walking-Related Human Activity Recognition for People with Mobility Disabilities Using a Smartwatch: A Pilot Study with Five Scenarios", "Link": "https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11492726", "Authors": "Myungwon Kang, Sungjin Hwang, Jucheol Moon, Jiwoong Heo, Yeji Woo, Hansung Kim, Jaehyuk Cha, Kwanguk Kenny Kim", "Publication date": "2023/7", "Journal": "\\ud55c\\uad6d\\ucef4\\ud4e8\\ud130\\uadf8\\ub798\\ud53d\\uc2a4\\ud559\\ud68c \\ud559\\uc220\\ub300\\ud68c", "Pages": "36-37", "Description": "Human activity recognition (HAR) is a widely applied technology with significant benefits when merged with smartwatch technology. However, smartwatch-based HAR studies for people with mobility disabilities have not been conducted rigorously. In this study, we propose a smartwatch-based HAR technique for detecting the type of mobility aids. Five walkingrelated scenarios across different mobility aids and environments were studied. Smartwatch data from six activities in two environments were collected from 40 participants, and six different machine learning techniques were investigated. The models classified the six activities with an average accuracy of 93.06%. We found that smartwatches can classify multiple walking-related activities for people with mobility disabilities."}', '{"Title": "User and Period Independent Transportation Mode Detection for Wheelchair Users", "Link": "https://ieeexplore.ieee.org/abstract/document/10032533/", "Authors": "Sungjin Hwang, Jiwoong Heo, Jucheol Moon, Jaehwan You, Hansung Kim, Jaehyuk Cha, Kwanguk Kim", "Publication date": "2023/1/31", "Journal": "IEEE Access", "Volume": "11", "Pages": "10801-10812", "Publisher": "IEEE", "Description": "Transportation mode detection (TMD) is an important research area in human activity recognition. It can improve the mobility and accessibility of people by providing a better understanding of their mobility patterns, thereby enhancing their quality of life and social inclusion. Although previous studies of TMD for people without mobility disabilities exhibited, the performance of TMD models on new users and periods was limited. This issue would be more important for people with mobility disabilities. This study investigated the negative impact of user and period differences on the performance of TMD for wheelchair users (wTMD) and suggested a method to address these challenges. Our main findings are (1) user and period differences degraded the wTMD performance from 94.28% to 59.32%; (2) the multi-DenseNet with a soft voting ensemble provided a 76.49% accuracy to data from different users and periods. We \\u2026", "Total citations": "Cited by 1\\n2023"}', '{"Title": "Online Waypoint Path Refinement for Mobile Robots using Spatial Definition and Classification based on Collision Probability", "Link": "https://ieeexplore.ieee.org/abstract/document/9887827/", "Authors": "Hongseok Cheon, Taehyoung Kim, Byung Kook Kim, Jucheol Moon, Hongjun Kim", "Publication date": "2022/9/12", "Journal": "IEEE Transactions on Industrial Electronics", "Volume": "70", "Issue": "7", "Pages": "7004-7013", "Publisher": "IEEE", "Description": "A novel online path refinement method is suggested for mobile robots, which refines the given path, including several waypoints using sensor data with a low computational load. The method periodically plans a waypoint path from the current robot position to a certain waypoint on the given waypoint path. While the robot moves along the given path, the path is continuously refined to avoid collisions and local minima caused by unmapped obstacles that are not represented on the map but sensed by sensors. Also, if a shortcut is detected while the robot is moving, the shortcut replaces the existing waypoint path. This online waypoint path refinement (OWPR) method is very practical in terms of computation time and memory size since it is performed regardless of the size of the workspace. To validate the actual performances of OWPR method, various simulations and experiments are conducted. As a result of the \\u2026", "Total citations": "Cited by 2\\n2023"}', '{"Title": "A Novel Method for Traffic Estimation and Air Quality Assessment in California", "Link": "https://www.mdpi.com/2071-1050/14/15/9169", "Authors": "Jucheol Moon, Jin Gi Hong, Tae-Won Park", "Publication date": "2022/7/26", "Journal": "Sustainability", "Volume": "14", "Issue": "15", "Pages": "9169", "Publisher": "MDPI", "Description": "Motor vehicle traffic is recognized as one of the critical factors that causes air pollution; however, the relationship between traffic volume and air pollutant concentrations is unclear, especially at a local level. Traditional traffic volume monitoring systems collect traffic data through counting the number of vehicles, using either sensors or surveillance cameras, but they have clear limitations such as they can only monitor certain areas and specific occasions. To overcome such limitations, we introduce a method of monitoring traffic volume in the local area by collecting estimated travel times for virtual trips in Google Maps. We began collecting the data in January 2020; ironically, the COVID-19 pandemic provided a natural experimental environment of showing unusual trends in traffic volume and unexpected changes in air pollutants. We demonstrate monthly traffic volumes in urban areas and analyze the correlation of traffic volume with typical traffic-related air pollutants using the proposed traffic volume monitoring method.", "Total citations": "Cited by 5\\n2022\\n2023"}', '{"Title": "Open Set User Identification Using Gait Pattern Analysis Based on Ensemble Deep Neural Network", "Link": "https://ieeexplore.ieee.org/abstract/document/9830528/", "Authors": "Jucheol Moon, Jinwon Jung, Eunice Kang, Sang-Il Choi", "Publication date": "2022/7/14", "Journal": "IEEE Sensors Journal", "Volume": "22", "Issue": "17", "Pages": "16975-16984", "Publisher": "IEEE", "Description": "The human gait is a unique biological characteristic of human beings and can be used for recognition task. Collecting gait information using wearable devices and identifying people with this data has been widely researched in recent times. Though many gait recognition studies have been conducted, few studies address the open set recognition problem where an unknown sample may be input into the system during the testing phase. A working model that overcomes this problem should correctly recognize whether a sample has never been seen before during training while maintaining high classification accuracy of known samples. We address the open set gait recognition problem by proposing a system that maps multi-modal unit step data gathered from insoles to an embedding vector in a latent space. Specifically, we collected the the time-series using sensor equipped insoles, and we process the raw multi \\u2026", "Total citations": "Cited by 1\\n2023"}', '{"Title": "An Automated Framework Based on Deep Learning for Shark Recognition", "Link": "https://www.mdpi.com/2077-1312/10/7/942", "Authors": "Nhat Anh Le, Jucheol Moon, Christopher G Lowe, Hyun-Il Kim, Sang-Il Choi", "Publication date": "2022/7/9", "Journal": "Journal of Marine Science and Engineering", "Volume": "10", "Issue": "7", "Pages": "942", "Publisher": "MDPI", "Description": "The recent progress in deep learning has given rise to a non-invasive and effective approach for animal biometrics. These modern techniques allow researchers to track animal individuals on a large-scale image database. Typical approaches are suited to a closed-set recognition problem, which is to identify images of known objects only. However, such approaches are not scalable because they mis-classify images of unknown objects. To recognize the images of unknown objects as \\u2018unknown\\u2019, a framework should be able to deal with the open set recognition scenario. This paper proposes a fully automatic, vision-based identification framework capable of recognizing shark individuals including those that are unknown. The framework first detects and extracts the shark from the original image. After that, we develop a deep network to transform the extracted image to an embedding vector in latent space. The proposed network consists of the Visual Geometry Group-UNet (VGG-UNet) and a modified Visual Geometry Group-16 (VGG-16) network. The VGG-UNet is utilized to detect shark bodies, and the modified VGG-16 is used to learn embeddings of shark individuals. For the recognition task, our framework learns a decision boundary using a one-class support vector machine (OSVM) for each shark included in the training phase using a few embedding vectors belonging to them, then it determines whether a new shark image is recognized as belonging to a known shark individual. Our proposed network can recognize shark individuals with high accuracy and can effectively deal with the open set recognition problem with shark images.", "Total citations": "Cited by 2\\n2022\\n2023"}', '{"Title": "Low-Speed Transportation Mode Detection for People with Mobility Disabilities: A Pilot Study", "Link": "https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11135624", "Authors": "Yeji Woo, Sungjin Hwang, Jiwoong Heo, Jucheol Moon, Hansung Kim, Jaehyuk Cha, Kwanguk Kenny Kim", "Publication date": "2022/7", "Journal": "\\ud55c\\uad6d\\ucef4\\ud4e8\\ud130\\uadf8\\ub798\\ud53d\\uc2a4\\ud559\\ud68c \\ud559\\uc220\\ub300\\ud68c", "Pages": "87-88", "Description": "Transportation mode detection (TMD) is useful human-computer interaction technique for people with and without handicap. Numerous studies on TMD have been conducted using deep learning models. However, studies on low-speed TMD for people with handicap especially wheelchair, crutch, and walker modes were limited. In this study, we collected sensor data on 6 different low-speed TMD transportation modes from 20 participants with their own smartphone. We proposed three deep learning methodologies: CNN, LSTM, and CNN-LSTM. The CNN-LSTM model achieved best accuracy of 94.8%. As a result, we expect to provide more customizable services on people with mobility disabilities based on the personal data."}', '{"Title": "Explainable gait recognition with prototyping encoder\\u2013decoder", "Link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0264783", "Authors": "Jucheol Moon, Yong-Min Shin, Jin-Duk Park, Nelson Hebert Minaya, Won-Yong Shin, Sang-Il Choi", "Publication date": "2022/3/11", "Journal": "Plos one", "Volume": "17", "Issue": "3", "Pages": "e0264783", "Publisher": "Public Library of Science", "Description": "Human gait is a unique behavioral characteristic that can be used to recognize individuals. Collecting gait information widely by the means of wearable devices and recognizing people by the data has become a topic of research. While most prior studies collected gait information using inertial measurement units, we gather the data from 40 people using insoles, including pressure sensors, and precisely identify the gait phases from the long time series using the pressure data. In terms of recognizing people, there have been a few recent studies on neural network-based approaches for solving the open set gait recognition problem using wearable devices. Typically, these approaches determine decision boundaries in the latent space with a limited number of samples. Motivated by the fact that such methods are sensitive to the values of hyper-parameters, as our first contribution, we propose a new network model that is less sensitive to changes in the values using a new prototyping encoder\\u2013decoder network architecture. As our second contribution, to overcome the inherent limitations due to the lack of transparency and interpretability of neural networks, we propose a new module that enables us to analyze which part of the input is relevant to the overall recognition performance using explainable tools such as sensitivity analysis (SA) and layer-wise relevance propagation (LRP).", "Total citations": "Cited by 2\\n2022"}', '{"Title": "Period Independent Transportation Mode Detection for People with Mobility Disabilities: A Pilot Study with DenseNet", "Link": "https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11043829", "Authors": "Sungjin Hwang, Jiwoong Heo, Jucheol Moon, Hansung Kim, Jaehyuk Cha, Kwanguk Kenny Kim", "Publication date": "2022/2", "Journal": "\\ud55c\\uad6d HCI \\ud559\\ud68c \\ud559\\uc220\\ub300\\ud68c", "Pages": "289-293", "Description": "Transportation mode detection (TMD) can help improving our daily life by understanding the mobility patterns of people. Such enhanced understanding of mobility can also be beneficial to people with mobility disabilities including wheelchair users. Moreover, as it is hard to collect large dataset from wheelchair users, it is important for TMD for wheelchair users (wTMD) to maintain similar performance on data from different period which might have dissimilar environmental or behavioral characteristics. However, we could not find studies evaluating such period independency of the wTMD model. Thus, we investigated wTMD performance on data from different period, and improved such performance by suggesting a new wTMD model. Our results showed that both our proposed model (DenseNet-based-model) and the baseline model (CNN-based-model) had period dependency, but our proposed model \\u2026"}', '{"Title": "Transportation Mode Detection for People with Mobility Disabilities: A Pilot Study on a User-independent Model", "Link": "https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11035918", "Authors": "Sungjin Hwang, Jiwoong Heo, Jucheol Moon, Hansung Kim, Jaehyuk Cha, Kwanguk Kenny Kim", "Publication date": "2021/12", "Journal": "\\ud55c\\uad6d\\uc815\\ubcf4\\uacfc\\ud559\\ud68c \\ud559\\uc220\\ubc1c\\ud45c\\ub17c\\ubb38\\uc9d1", "Pages": "983-985", "Description": "Transportation mode detection (TMD) can improve our daily lives by understanding the mobility patterns of people. Moreover, such understanding of the mobility can be especially beneficial to wheelchair users. However, the previous study showed that TMD performance decreased when tested with new users which were not used for machine learning, and this problem also possible on TMD for people with mobility disabilities. Therefore, we investigate t"}', '{"Title": "Road traffic monitoring from UAV images using deep learning networks", "Link": "https://www.mdpi.com/2072-4292/13/20/4027", "Authors": "Sungwoo Byun, In-Kyoung Shin, Jucheol Moon, Jiyoung Kang, Sang-Il Choi", "Publication date": "2021/10/9", "Journal": "Remote Sensing", "Volume": "13", "Issue": "20", "Pages": "4027", "Publisher": "MDPI", "Description": "In this paper, we propose a deep neural network-based method for estimating speed of vehicles on roads automatically from videos recorded using unmanned aerial vehicle (UAV). The proposed method includes the following; (1) detecting and tracking vehicles by analyzing the videos, (2) calculating the image scales using the distances between lanes on the roads, and (3) estimating the speeds of vehicles on the roads. Our method can automatically measure the speed of the vehicles from the only videos recorded using UAV without additional information in both directions on the roads simultaneously. In our experiments, we evaluate the performance of the proposed method with the visual data at four different locations. The proposed method shows 97.6% recall rate and 94.7% precision rate in detecting vehicles, and it shows error (root mean squared error) of 5.27 km/h in estimating the speeds of vehicles.", "Total citations": "Cited by 19\\n2022\\n2023"}', '{"Title": "Multimodal few-shot learning for gait recognition", "Link": "https://www.mdpi.com/2076-3417/10/21/7619", "Authors": "Jucheol Moon, Nhat Anh Le, Nelson Hebert Minaya, Sang-Il Choi", "Publication date": "2020/10/29", "Journal": "Applied Sciences", "Volume": "10", "Issue": "21", "Pages": "7619", "Publisher": "MDPI", "Description": "A person\\u2019s gait is a behavioral trait that is uniquely associated with each individual and can be used to recognize the person. As information about the human gait can be captured by wearable devices, a few studies have led to the proposal of methods to process gait information for identification purposes. Despite recent advances in gait recognition, an open set gait recognition problem presents challenges to current approaches. To address the open set gait recognition problem, a system should be able to deal with unseen subjects who have not included in the training dataset. In this paper, we propose a system that learns a mapping from a multimodal time series collected using insole to a latent (embedding vector) space to address the open set gait recognition problem. The distance between two embedding vectors in the latent space corresponds to the similarity between two multimodal time series. Using the characteristics of the human gait pattern, multimodal time series are sliced into unit steps. The system maps unit steps to embedding vectors using an ensemble consisting of a convolutional neural network and a recurrent neural network. To recognize each individual, the system learns a decision function using a one-class support vector machine from a few embedding vectors of the person in the latent space, then the system determines whether an unknown unit step is recognized as belonging to a known individual. Our experiments demonstrate that the proposed framework recognizes individuals with high accuracy regardless they have been registered or not. If we could have an environment in which all people would be wearing the \\u2026", "Total citations": "Cited by 11\\n2021\\n2022\\n2023"}', '{"Title": "Can ensemble deep learning identify people by their gait using data collected from multi-modal sensors in their insole?", "Link": "https://www.mdpi.com/1424-8220/20/14/4001", "Authors": "Jucheol Moon, Nelson Hebert Minaya, Nhat Anh Le, Hee-Chan Park, Sang-Il Choi", "Publication date": "2020/7/18", "Journal": "Sensors", "Volume": "20", "Issue": "14", "Pages": "4001", "Publisher": "MDPI", "Description": "Gait is a characteristic that has been utilized for identifying individuals. As human gait information is now able to be captured by several types of devices, many studies have proposed biometric identification methods using gait information. As research continues, the performance of this technology in terms of identification accuracy has been improved by gathering information from multi-modal sensors. However, in past studies, gait information was collected using ancillary devices while the identification accuracy was not high enough for biometric identification. In this study, we propose a deep learning-based biometric model to identify people by their gait information collected through a wearable device, namely an insole. The identification accuracy of the proposed model when utilizing multi-modal sensing is over 99%.", "Total citations": "Cited by 16\\n2020\\n2021\\n2022"}', '{"Title": "A biometric for shark dorsal fins based on boundary descriptor matching", "Link": "https://5wwwww.easychair.org/publications/download/1Rr8", "Authors": "Taina Coleman, Jucheol Moon", "Publication date": "2019/9/26", "Journal": "Proceedings of 32nd International Conference on Computer Applications in Industry and Engineering", "Volume": "63", "Pages": "63-71", "Description": "Recent progress in animal biometrics has revolutionized wildlife research. Cutting edge techniques allow researchers to track individuals through noninvasive methods of recognition that are not only more reliable, but also applicable to large, hard-to-find, and otherwise difficult to observe animals. In this research, we propose a metric for boundary descriptors based on bipartite perfect matching applied in shark dorsal fins. In order to identify a shark, we first take a fin contour and transform it to a normalized coordinate system so that we can analyze images of sharks regardless of orientation and scale. Finally, we propose a metric scheme that performs a minimum weight perfect matching in a bipartite graph. The experimental results show that our metric is applicable to identify and track individuals from visual data.", "Total citations": "Cited by 3\\n2020\\n2021\\n2022"}', '{"Title": "User identification from gait analysis using multi-modal sensors in smart insole", "Link": "https://www.mdpi.com/1424-8220/19/17/3785", "Authors": "Sang-Il Choi, Jucheol Moon, Hee-Chan Park, Sang Tae Choi", "Publication date": "2019/8/31", "Journal": "Sensors", "Volume": "19", "Issue": "17", "Pages": "3785", "Publisher": "MDPI", "Description": "Recent studies indicate that individuals can be identified by their gait pattern. A number of sensors including vision, acceleration, and pressure have been used to capture humans\\u2019 gait patterns, and a number of methods have been developed to recognize individuals from their gait pattern data. This study proposes a novel method of identifying individuals using null-space linear discriminant analysis on humans\\u2019 gait pattern data. The gait pattern data consists of time series pressure and acceleration data measured from multi-modal sensors in a smart insole used while walking. We compare the identification accuracies from three sensing modalities, which are acceleration, pressure, and both in combination. Experimental results show that the proposed multi-modal features identify 14 participants with high accuracy over 95% from their gait pattern data of walking.", "Total citations": "Cited by 33\\n2020\\n2021\\n2022\\n2023"}', '{"Title": "The Cluster Affinity Distance for Phylogenies", "Link": "https://link.springer.com/chapter/10.1007/978-3-030-20242-2_5", "Authors": "Jucheol Moon, Oliver Eulenstein", "Publication date": "2019", "Conference": "Bioinformatics Research and Applications: 15th International Symposium, ISBRA 2019, Barcelona, Spain, June 3\\u20136, 2019, Proceedings 15", "Pages": "52-64", "Publisher": "Springer International Publishing", "Description": "Studying phylogenetic trees is fundamental to biology and benefitting a vast variety of other research areas. Comparing such trees is essential to such studies for which a growing and diverse collection of tree distances are available. In practice, tree distances suffer from problems that can severely limit their applicability. Notably, these distances include the cluster matching distance that is adapted from the Robinson-Foulds distance to overcome many of the drawbacks of this traditional measure. However, at the same time, the cluster matching distance is much more confined in its application than the Robinson-Foulds distance and makes sacrifices for satisfying the properties of a metric. Here, we propose the cluster affinity distance, a new tree distance that is adapted from the cluster matching distance but has not its drawbacks. Nevertheless, as we show, the cluster affinity distance preserves all of the \\u2026", "Total citations": "Cited by 3\\n2022\\n2023"}', '{"Title": "Cluster matching distance for rooted phylogenetic trees", "Link": "https://link.springer.com/chapter/10.1007/978-3-319-94968-0_31", "Authors": "Jucheol Moon, Oliver Eulenstein", "Publication date": "2018", "Conference": "Bioinformatics Research and Applications: 14th International Symposium, ISBRA 2018, Beijing, China, June 8-11, 2018, Proceedings 14", "Pages": "321-332", "Publisher": "Springer International Publishing", "Description": "Phylogenetic trees are fundamental to biology and are benefitting several other research areas. Various methods have been developed for inferring such trees, and comparing them is an important problem in computational phylogenetics. Addressing this problem requires tree measures, but all of them suffer from problems that can severely limit their applicability in practice. This also holds true for one of the oldest and most widely used tree measures, the Robinson-Foulds distance. While this measure is satisfying the properties of a metric and is efficiently computable, it has a negatively skewed distribution, a poor range of discrimination and diameter, and may not be robust when comparing erroneous trees. The cluster distance is a measure for comparing rooted trees that can be interpreted as a weighted version of the Robinson-Foulds distance. We show that when compared with the Robinson-Foulds \\u2026", "Total citations": "Cited by 6\\n2019\\n2020\\n2021\\n2022"}', '{"Title": "Synthesizing species trees from unrooted gene trees: A parameterized approach", "Link": "https://dl.acm.org/doi/abs/10.1145/3107411.3107450", "Authors": "Jucheol Moon, Oliver Eulenstein", "Publication date": "2017/8/20", "Book": "Proceedings of the 8th ACM International Conference on Bioinformatics, Computational Biology, and Health Informatics", "Pages": "253-262", "Description": "Synthesizing species trees from a collection of smaller gene trees is a widely used approach for inferring credible species tree estimates. While corresponding computational problems are typically NP-hard, several of these problems have been effectively addressed by using the parameterized Strict Consensus Approach. This approach is limited to gene trees that are rooted. In practice, however, most gene trees are unrooted, and it is often difficult, if not impossible, to identify accurate rootings. Here, we address this stringent limitation by proposing efficient algorithms that adopt the parameterized Strict Consensus Approach to handle unrooted gene trees. Finally, we demonstrate the performance of our algorithms in a comparative study using empirical and simulated data sets.", "Total citations": "Cited by 4\\n2018\\n2019\\n2020"}', '{"Title": "Synthesizing large-scale species trees using the strict consensus approach", "Link": "https://www.worldscientific.com/doi/abs/10.1142/S0219720017400029", "Authors": "Jucheol Moon, Oliver Eulenstein", "Publication date": "2017/6/17", "Journal": "Journal of bioinformatics and computational biology", "Volume": "15", "Issue": "03", "Pages": "1740002", "Publisher": "World Scientific Publishing Company", "Description": "Supertree problems are a standard tool for synthesizing large-scale species trees from a given collection of gene trees under some problem-specific objective. Unfortunately, these problems are typically NP-hard, and often remain so when their instances are restricted to rooted gene trees sampled from the same species. While a class of restricted supertree problems has been effectively addressed by the parameterized strict consensus approach, in practice, most gene trees are unrooted and sampled from different species. Here, we overcome this stringent limitation by describing efficient algorithms that are adopting the strict consensus approach to also handle unrestricted supertree problems. Finally, we demonstrate the performance of our algorithms in a comparative study with classic supertree heuristics using simulated and empirical data sets.", "Total citations": "Cited by 5\\n2017\\n2018\\n2019\\n2020\\n2021\\n2022\\n2023"}', '{"Title": "Synthesizing species trees from gene trees using the parameterized and graph-theoretic approaches", "Link": "https://search.proquest.com/openview/87d51edb0d2af3f9dce79395ed5b471c/1?pq-origsite=gscholar&cbl=18750", "Authors": "Ju Cheol Moon", "Publication date": "2017", "Institution": "Iowa State University", "Description": "Gene trees describe how parts of the species have evolved over time, and it is assumed that gene trees have evolved along the branches of the species tree. However, some of gene trees are often discordant with the corresponding species tree due to the complicated evolution history of genes. To overcome this obstacle, median problems have emerged as a major tool for synthesizing species trees by reconciling discordance in a given collection of gene trees. Given a collection of gene trees and a cost function, the median problem seeks a tree, called median tree, that minimizes the overall cost to the gene trees. Median tree problems are typically NP-hard, and there is an increased interest in making such median tree problems available for large-scale species tree construction."}']